//напишите программу, котораЯ на вход 
//принимает число и выдает его квадрат
Console.WriteLine("‚ведите число");
int num = int.Parse(Console.ReadLine());
int resalt = num * num;
Console.WriteLine($"квадрат числа = {resalt}");