// Напишите программу замена элементов массива: 
//положительные элементы замените на 
//соответствующие отрицательные, и наоборот.
//[-4, -8, 8, 2] -> [4, 8, -8, -2] 

int[] mas = new mas[-4, -8, 8, 2];
Console.WriteLine("Hello, World!");
