// Напишите программу, которая находит
// элемент массива методом деления 
// отрезка пополам

int Prompt(string message)
{
    Console.Write(message);
    string value = Console.ReadLine();
    int result = Convert.ToInt32(value);
    return result;
}
arr AddArray(int[] mas)
{


}


int[] mas = new int[n];
Console.WriteLine("Hello, World!");
