// Напишите программу, которая будет создавать копию 
// bзаданного массива с помощью поэлементного копирования.

Console.WriteLine("Hello, World!");
